Revit 2026 API
AreaLoad.Create Method
Overload List
Name | Description
Create(Document, ElementId, XYZ, AreaLoadType) |  Creates a new hosted area load within the project.
Create(Document, ElementId, IList<CurveLoop>, XYZ, AreaLoadType)
Create(Document, ElementId, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType)
Top
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace